In [15]:
import pandas as pd
from sqlalchemy import create_engine

df_01 = pd.read_csv('legislators.csv')
df_02 = pd.read_csv('legislators_terms.csv')

engine = create_engine('postgresql://testuser:testpass@localhost:5432/sql_analysis')

df_01.to_sql("legislators", engine)
df_02.to_sql("legislators_terms", engine)

ValueError: Table 'legislators' already exists.

In [20]:
import psycopg2 as pg2

con = pg2.connect(host='localhost',
                  user='testuser',
                  password='tespass',
                  database='sql_analysis')
con.autocommit = True
cur = con.cursor()

### Cohort Analysis

A `cohort` is a group of individuals who share some characteristic of interest, described below, at the time we start observing them.

`Cohort analysis` is a useful way to compare groups of entities over time. Many important behaviors take weeks, months, or years to occur or evolve, and cohort analysis is a way to understand these changes. Cohort analysis provides a framework for detecting correlations between cohort characteristics and these long-term trends, which can lead to hypotheses about the causal drivers.

Cohort analysis can be used to monitor new cohorts of users or customers and assess how they compare to previous cohorts. Such monitoring can provide an early alert signal that something has gone wrong (or right) for new customers. Cohort analysis is also used to mine historical data. A/B tests are the gold standard for determin‐ing causality, but we can’t go back in time and run every test for every question about the past in which we are interested.

`Cohort grouping` is often based on a start date: the customer’s first purchase or subscription date, the date a student started school, and so on.

> **Cohort or Segment?**
>
> A `cohort` is a group of users (or other entities) who have a common starting date and are followed over time. A `segment` is a grouping of users who share a common characteristic or set of characteristics at a point in time, regardless of their starting date.

#### Types of cohort anlaysis
---

**Retention**

Retention is concerned with whether the cohort member has a record in the time series on a particular date, expressed as a number of periods from the starting date. This is useful in any kind of organization in which repeated actions are expected, from playing an online game to using a product or renewing a subscription, and it helps to answer questions about how sticky or engaging a product is and how many entities can be expected to appear on future dates.

**Survivorship**

Survivorship is concerned with how many entities remained in the data set for a certain length of time or longer, regardless of the number or frequency of actions up to that time. Survivorship is useful for answering questions about the proportion of the population that can be expected to remain—either in a positive sense by not churning or passing away, or in a negative sense by not graduating or fulfilling some requirement.

**Returnship**

Returnship or repeat purchase behavior is concerned with whether an action has happened more than some minimum threshold of times—often simply more than once—during a fixed window of time. This type of analysis is useful in situations in which the behavior is intermittent and unpredictable, such as in retail, where it characterizes the share of repeat purchasers in each cohort within a fixed time window.

**Cumulative**

Cumulative calculations are concerned with the total number or amounts measured at one or more fixed time windows, regardless of when they happened during that window. Cumulative calculations are often used in calculations of customer lifetime value (LTV or CLTV).

#### The Legislators Data Set

The SQL examples in this chapter will use a data set of past and present members of the United States Congress.

Congress has two chambers, the Senate (“sen” in the data set) and the House of Representatives (“rep”). Each state has two senators, and they are elected for six-year terms. Representatives are allocated to states based on population; each representative has a district that they alone represent. Representatives are elected for two-year terms.

Actual terms in either chamber can be shorter in the event that the legislator dies or is elected or appointed to a higher office. Legislators accumulate power and influence via leadership positions the longer they are in office, and thus standing for re-election is common. 

Finally, a legislator may belong to a political party, or they may be an “independent.” In the modern era, the vast majority of legislators are Democrats or Republicans, and the rivalry between the two parties is well known.

#### Retention

Retention analysis uses the count of entities or sum of money or actions present in the data set for each period from the starting date, and it normalizes by dividing this number by the count or sum of entities, money, or actions in the first time period. The result is expressed as a percentage, and retention in the starting period is always 100%. Over time, retention based on counts generally declines and can never exceed 100%, whereas money- or action-based retention, while often declining, can increase and be greater than 100% in a time period. Retention analysis output is typically displayed in either table or graph form, which is referred to as a retention curve.

In [21]:
query_01 = """
        SELECT id_bioguide
            ,min(term_start) as first_term
        FROM legislators_terms 
        GROUP BY 1
        """

sql_01 = pd.read_sql(query_01, con)
sql_01

      id_bioguide  first_term
0         A000118  1975-01-14
1         P000281  1933-03-09
2         K000039  1933-03-09
3         A000306  1907-12-02
4         O000095  1949-01-03
...           ...         ...
12513     G000331  1949-01-03
12514     M000103  1867-03-04
12515     B000255  1821-12-03
12516     L000152  1891-12-07
12517     S000687  1895-12-02

[12518 rows x 2 columns]

In [34]:
query_02 = """
        SELECT date_part('year', age(b.term_start, a.first_term)) as periods
            ,count(distinct a.id_bioguide) as cohort_retained
        FROM
        (
                SELECT id_bioguide
                ,min(term_start) as first_term
                FROM legislators_terms 
                GROUP BY 1
        ) a
        JOIN legislators_terms b on a.id_bioguide = b.id_bioguide 
        GROUP BY 1
        """

sql_02 = pd.read_sql(query_02, con)
sql_02.head()

   periods  cohort_retained
0      0.0            12518
1      1.0             3600
2      2.0             3619
3      3.0             1831
4      4.0             3210

In [36]:
query_03 = """
        SELECT period
            ,first_value(cohort_retained) over (order by period) as cohort_size
            ,cohort_retained
            ,cohort_retained * 1.0 / first_value(cohort_retained) over (order by period) as pct_retained
        FROM
        (
            SELECT date_part('year',age(b.term_start,a.first_term)) as period
            ,count(distinct a.id_bioguide) as cohort_retained
            FROM
            (
                    SELECT id_bioguide
                    ,min(term_start) as first_term
                    FROM legislators_terms 
                    GROUP BY 1
            ) a
            JOIN legislators_terms b on a.id_bioguide = b.id_bioguide 
            GROUP BY 1
        )
        """

sql_03 = pd.read_sql(query_03, con)
sql_03.head()

DatabaseError: Execution failed on sql '
        SELECT period
            ,first_value(cohort_retained) over (order by period) as cohort_size
            ,cohort_retained
            ,cohort_retained * 1.0 / first_value(cohort_retained) over (order by period) as pct_retained
        FROM
        (
            SELECT date_part('year',age(b.term_start,a.first_term)) as period
            ,count(distinct a.id_bioguide) as cohort_retained
            FROM
            (
                    SELECT id_bioguide
                    ,min(term_start) as first_term
                    FROM legislators_terms
                    GROUP BY 1
            ) a
            JOIN legislators_terms b on a.id_bioguide = b.id_bioguide
            GROUP BY 1
        )
        ': subquery in FROM must have an alias
LINE 7:         (
                ^
HINT:  For example, FROM (SELECT ...) [AS] foo.

In [38]:
query_04 = """
        SELECT cohort_size
            ,max(case when period = 0 then pct_retained end) as yr0
            ,max(case when period = 1 then pct_retained end) as yr1
            ,max(case when period = 2 then pct_retained end) as yr2
            ,max(case when period = 3 then pct_retained end) as yr3
            ,max(case when period = 4 then pct_retained end) as yr4
        FROM
        (
            SELECT period
            ,first_value(cohort_retained) over (order by period) as cohort_size
            ,cohort_retained
            ,cohort_retained * 1.0 / first_value(cohort_retained) over (order by period) as pct_retained
            FROM
            (
                SELECT 
                date_part('year',age(b.term_start,a.first_term)) as period
                ,count(*) as cohort_retained
                FROM
                (
                        SELECT id_bioguide
                        ,min(term_start) as first_term
                        FROM legislators_terms 
                        GROUP BY 1
                ) a
                JOIN legislators_terms b on a.id_bioguide = b.id_bioguide 
                GROUP BY 1
            ) aa
        ) aaa
        GROUP BY 1
        """

sql_04 = pd.read_sql(query_04, con)
sql_04.head()

   cohort_size  yr0       yr1      yr2       yr3       yr4
0        12647  1.0  0.284732  0.28655  0.145015  0.253973

#### Adjusting Time Series to Increase Retention Accuracy

In the legislators data set, we have a record for a term’s start date, but we are missing the notion that this “entitles” a legislator to serve for two or six years, depending on the chamber.

Calculating retention using a start and end date defined in the data is the most accurate approach. For the following examples, we will consider legislators retained in a particular year if they were still in office as of the last day of the year, December 31. Prior to the Twentieth Amendment to the US Constitution, terms began on March 4, but afterward the start date moved to January 3, or to a subsequent weekday if the third falls on a weekend. Legislators can be sworn in on other days of the year due to special off-cycle elections or appointments to fill vacant seats. As a result, term_start dates cluster in January but are spread across the year. 

While we could pick another day, **December 31** is a strategy for normalizing around these varying start dates.